{"id":94,"date":"2019-09-26T07:56:05","date_gmt":"2019-09-26T07:56:05","guid":{"rendered":"https:\/\/oscwebdesign.biz\/?page_id=94"},"modified":"2021-05-03T09:49:14","modified_gmt":"2021-05-03T13:49:14","slug":"terms-of-use","status":"publish","type":"page","link":"https:\/\/oscwebdesign.biz\/terms-of-use\/","title":{"rendered":"Terms Of Use"},"content":{"rendered":"\n<h2 id=\"h-terms-of-service\">Terms of Service<\/h2>\n\n\n\n<p><a href=\"https:\/\/oscwebdesign.biz\/\">OSC Web Design<\/a><br>last updated May 25th, 2017<\/p>\n\n\n\n<h3 id=\"h-acceptance-of-contract-terms-and-conditions-of-use-also-the-terms\">ACCEPTANCE OF CONTRACT TERMS AND CONDITIONS OF USE (ALSO, THE “TERMS”)<\/h3>\n\n\n\n<p>This is a website of OSC Web Design (also referred to as “OSC,” “us,” or “we”). We welcome you to the website&nbsp;<a href=\"https:\/\/oscwebdesign.biz\/\">www.oscwebdesign.biz<\/a>, and its associated pages (collectively, the “Site”). OSC is an internet marketing and web design company.<\/p>\n\n\n\n<p>Our postal address is:<br><strong>OSC Web Design<\/strong><br>PO Box 1691<br>Scarborough, ME 04070<\/p>\n\n\n\n<p>We can be reached via e-mail at&nbsp;<a href=\"mailto:info@oscwebdesign.biz\">info@oscwebdesign.biz<\/a>&nbsp;or you can reach us by telephone at&nbsp;<a>(207) 303-0048<\/a>.<\/p>\n\n\n\n<p><strong>PLEASE READ THESE TERMS OF USE CAREFULLY. BY USING THE SITE, YOU AGREE TO ADHERE TO AND BE BOUND BY THESE TERMS OF USE, THE PRIVACY POLICY, AND, AS APPLICABLE, THE CONSENT TO ELECTRONIC COMMUNICATIONS AND ANY ACCOUNT TERMS AVAILABLE ONLINE. THESE TERMS OF USE MAY BE MODIFIED FROM TIME TO TIME IN THE SOLE DISCRETION OF OSC. IF YOU DO NOT AGREE TO BE LEGALLY BOUND, YOU ARE NOT PERMITTED TO USE THE SITE.<\/strong><\/p>\n\n\n\n<p>Thus, these Terms and Conditions of Use, the Privacy Policy and, as applicable the Consent to Electronic Communication, and any Account terms available online form a legal agreement between you and OSC. By using and downloading this Site you are acknowledging that you have read, understood, and agree to be bound by these documents, as well as all applicable laws and regulations.<\/p>\n\n\n\n<h3 id=\"h-use-restrictions\">USE RESTRICTIONS<\/h3>\n\n\n\n<p>The material provided on this Site is protected by law, including but not limited to, United States Copyright Law and international treaties. The contents of this Site are copyright ©2014, OSC Web Design, with all rights reserved. Subject to the terms and conditions herein, a limited license is granted to you to display, use, and download the materials on this Site for your internal use only, provided you do not modify the materials and that you preserve all copyright and other proprietary notices contained in the materials. Except as stated above, none of the material on this Site may be copied, reproduced, distributed, published, downloaded, displayed, posted or transmitted in any form or by any means including, but not limited to, electronic, mechanical, photocopying, recording, or otherwise without the prior written permission of OSC. This permission terminates automatically if you breach any of these terms or conditions, or upon the request of OSC Web Design. Upon termination you must immediately destroy any downloaded and printed materials. You also can not “mirror” or “frame” any material contained on this Site. Any unauthorized use of any material contained on this Site may violate copyright laws, trademark laws, and various other regulations and statutes. You agree not to interrupt or attempt to interrupt the operation of the Site in any way. OSC reserves all rights not expressly granted herein. OSC may terminate this limited license for any reason.<\/p>\n\n\n\n<h3 id=\"h-trademarks\">TRADEMARKS<\/h3>\n\n\n\n<p>The “OSC,” “OSC Web Design,” etc., trademarks, service marks, and associated logos (collectively, the “Trademarks”) that are used and displayed on this Site are registered and unregistered trademarks of OSC Web Design. Nothing on this Site should be construed as granting, by implication, estoppel, or otherwise, any license or right to use any Trademark displayed on this Site without the written permission of the Trademark owner. OSC enforces its intellectual property rights to the fullest extent of the law. OSC prohibits use of the Trademarks as a “hot” link to the OSC Site unless establishment of such a link is approved in advance by OSC in writing. Use of any of the Trademarks as meta-tags or embedded text on other web sites, for search engine subject matter marketing, or as a spoofed email address are also expressly prohibited.<\/p>\n\n\n\n<h3 id=\"h-disclaimer\">DISCLAIMER<\/h3>\n\n\n\n<p><strong>THIS SITE AND THE INFORMATION PROVIDED HEREIN ARE PROVIDED “AS IS” WITHOUT WARRANTIES OF ANY KIND EITHER EXPRESS OR IMPLIED. TO THE FULLEST EXTENT POSSIBLE PURSUANT TO THE APPLICABLE LAW, OSC DISCLAIMS ALL WARRANTIES, EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT OR OTHER VIOLATION OF RIGHTS. OSC DOES NOT WARRANT OR MAKE ANY REPRESENTATIONS REGARDING THE USE, CONTENT, SECURITY, VALIDITY, ACCURACY, OR RELIABILITY OF, OR THE RESULTS OF THE USE OF, OR OTHERWISE RESPECTING, THE INFORMATION, CONTENT, OR MATERIALS ON THIS SITE OR ANY SITES LINKED TO THIS SITE.<\/strong><\/p>\n\n\n\n<p><strong>UNDER NO CIRCUMSTANCES, INCLUDING, BUT NOT LIMITED TO, NEGLIGENCE, SHALL OSC BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES, INCLUDING, BUT NOT LIMITED TO, HARM TO EQUIPMENT AND\/OR PERSONAL INJURY OR DEATH, ARISING OUT OF THE USE, OR THE INABILITY TO USE, THE INFORMATION, CONTENT, OR MATERIALS ON THIS SITE, EVEN IF OSC OR A OSC AUTHORIZED REPRESENTATIVE HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IF YOUR USE OF THIS SITE OR THE INFORMATION, CONTENT, OR MATERIALS THEREIN RESULTS IN THE NEED FOR SERVICING, REPAIR, OR CORRECTION OF ANY ITEM, YOU ASSUME ANY AND ALL COSTS THEREOF. SOME STATES DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THE ABOVE LIMITATION OR EXCLUSION MAY NOT APPLY TO YOU.<\/strong><\/p>\n\n\n\n<p>You agree to comply with, and accept full responsibility for your compliance with all applicable laws.<\/p>\n\n\n\n<h3 id=\"h-typographical-errors\">TYPOGRAPHICAL ERRORS<\/h3>\n\n\n\n<p>OSC has attempted to provide accurate information on the Site; however, OSC does not assume, and shall have no responsibility for, the accuracy of the information on the Site. The information on this Site may include inaccuracies, such as technical errors, omissions, or typographical errors, etc. OSC makes no commitment to update the materials or information on this Site; use of this Site is at your sole risk. OSC may change the information on this Site at any time without notice to you.<\/p>\n\n\n\n<h3 id=\"h-postings-and-privacy\">POSTINGS AND PRIVACY<\/h3>\n\n\n\n<p>Except as otherwise noted, unsolicited submissions of materials, information, or ideas will be treated as non-confidential and non-proprietary, and may be disseminated or used by OSC or its affiliates. Notwithstanding the foregoing, OSC will make reasonable efforts to handle personal identifying information in accordance with the OSC Site&nbsp;<a href=\"https:\/\/oscwebdesign.biz\/privacy-policy\">privacy policy<\/a>. You are prohibited from posting or transmitting to or from this Site any unlawful, threatening, libelous, defamatory, obscene, scandalous, inflammatory, pornographic or profane material or any other material that could give rise to any civil or criminal liability under the law. This Site is not intended for minors. OSC does not knowingly collect personally identifiable information from children under 18 years of age. If you are a minor, you are not authorized to use this Site or to provide information to OSC.<\/p>\n\n\n\n<p>OSC may provide links to other sites as a convenience, but OSC accepts no responsibility for the content of such sites and the link should not be construed as an endorsement or affiliation.<\/p>\n\n\n\n<h3 id=\"h-acceptance-policy\">ACCEPTANCE POLICY<\/h3>\n\n\n\n<p>Your receipt of an electronic or other form of confirmation does not signify our acceptance of an account application or other order, nor does it constitute confirmation of our offer of an account or an offer to sell. OSC reserves the right at any time after receipt of your application or order to accept or decline for any reason.<\/p>\n\n\n\n<h3 id=\"h-revision-of-the-term-and-conditions-of-use\">REVISION OF THE TERM AND CONDITIONS OF USE<\/h3>\n\n\n\n<p>OSC may at any time revise this Site and these Terms and Conditions of Use by updating this posting. By using this Site, you agree to be bound by any such revisions in effect and should therefore periodically visit this page to determine the then current Terms and Conditions of Use to which you are bound. If you continue to use this Site after a revision to the Terms and Conditions of Use, you agree to be bound to the new agreement. If you do not wish to be bound to the new agreement, do not use the Site. If a court of competent jurisdiction rules any portion of these Terms of Use to be invalid or unenforceable, then that portion should be deemed amended in order to achieve as closely as possible the same effect as originally drafted to the extent valid and enforceable; these terms are severable such that the valid and enforceable terms shall remain unaffected.<\/p>\n\n\n\n<p>OSC may at any time revise this Site and these Terms and Conditions of Use by updating this posting. When we do, if you are a registered user or an account holder, we will notify you by e-mail. It is therefore very important that you make sure to notify us when your e-mail address changes. You may do so by contacting us at the address above. If you continue to use this Site after a revision to the Terms and Conditions of Use, you agree to be bound to the new agreement. If you do not wish to be bound to the new agreement, do not use the Site.<\/p>\n\n\n\n<h3 id=\"h-no-spam\">NO SPAM<\/h3>\n\n\n\n<p>You may not use this Site to transmit unsolicited email. You may not transmit unsolicited email to this Site or to anyone whose email address includes the domain name used on this Site. You may not use our domain name as a pseudonymous return email address for any communications that you transmit from another location or through another service. You may not pretend to be someone else—or spoof their identity—when using this Site or any resources provided here.<\/p>\n\n\n\n<h3 id=\"h-miscellaneous\">MISCELLANEOUS<\/h3>\n\n\n\n<p>Any and all claims or disputes relating to or arising from your use of this Site or the information, content, materials on the Site, and the services and products of OSC, or the interpretation and enforcement of this agreement shall be governed by the laws of the Commonwealth of Virginia, as it applies to a contract executed, delivered and performed solely in Virginia, and without regard to any conflict of law provisions. Any action or proceeding seeking to enforce any provision of, or based on any right arising out of, this Agreement shall be brought against either of the parties only in the courts of the Commonwealth of Virginia, City of Richmond or, if it has or can acquire jurisdiction, in the United States District Court for the Eastern District of Virginia, Richmond Division, and you and OSC consent to the exclusive jurisdiction of such courts (and of the appropriate appellate courts) in any such action or proceeding and waives any objection to venue. Process in any action or proceeding referred to in the preceding sentence may be served anywhere in the world. Your use of the Site does not subject OSC to any judicial process or to the jurisdiction or venue of any courts or tribunals other than those identified above, including without limitation, those in your jurisdiction or location.<\/p>\n\n\n\n<p>This agreement is between you and OSC. There are no third party beneficiaries.<\/p>\n\n\n\n<p>This agreement in these Terms and Conditions of Use, along with the Privacy Policy, the Consent to Electronic Communications, and any account terms, all of which are incorporated herein (and are available for review), constitute the entire agreement between you and OSC regarding your use of this Site and OSC’ services and products hereunder. The failure of OSC to exercise or enforce any right or provision of this agreement shall not operate as a waiver of such right or provision.<\/p>\n\n\n\n<p>You and OSC agree that the Uniform Computer Transactions Act or any version thereof, adopted by any state, in any form (“UCITA”), shall not apply to this agreement. To the extent that UCITA is applicable, the parties agree to opt out of the applicability of UCITA pursuant to the opt-out provision(s) contained therein.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Terms of Service OSC Web Designlast updated May 25th, 2017 ACCEPTANCE OF CONTRACT TERMS AND CONDITIONS OF USE (ALSO, THE “TERMS”) This is a website of OSC Web Design (also referred to as “OSC,” “us,” or “we”). We welcome you to the website&nbsp;www.oscwebdesign.biz, and its associated pages (collectively, the “Site”). OSC is an internet marketing [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_mi_skip_tracking":false},"acf":[],"_links":{"self":[{"href":"https:\/\/oscwebdesign.biz\/wp-json\/wp\/v2\/pages\/94"}],"collection":[{"href":"https:\/\/oscwebdesign.biz\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/oscwebdesign.biz\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/oscwebdesign.biz\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/oscwebdesign.biz\/wp-json\/wp\/v2\/comments?post=94"}],"version-history":[{"count":0,"href":"https:\/\/oscwebdesign.biz\/wp-json\/wp\/v2\/pages\/94\/revisions"}],"wp:attachment":[{"href":"https:\/\/oscwebdesign.biz\/wp-json\/wp\/v2\/media?parent=94"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}